#+TITLE: Wiki
*** Example


#+NAME: students
| Name   | Mark |
|--------+------|
| Alice  |   79 |
| Bob    |   19 |
| Claire |   50 |
| Dave   |   49 |
| Eve    |   87 |
| Frank  |   73 |


#+BEGIN_SRC emacs-lisp :var students=students :exports both
(mapcar 
 (lambda(x) 
   (list 
    (car x) 
    (if (>= (car (cdr x)) 50)
	"Pass"
      "Fail"))) students)

#+END_SRC

#+RESULTS:
| Alice  | Pass |
| Bob    | Fail |
| Claire | Pass |
| Dave   | Fail |
| Eve    | Pass |
| Frank  | Pass |


